tap "beeftornado/rmtree"
tap "caffix/amass"
tap "deiga/versions", "https://github.com/deiga/homebrew-versions.git"
tap "goreleaser/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kryptco/tap"
tap "liamg/tfsec"
tap "ojford/formulae"
tap "sambadevi/powerlevel9k"
tap "scottrigby/macos-configurator"
tap "teamookla/speedtest"
tap "tomanthony/brews"
tap "vitorgalvao/tiny-scripts"
tap "wagoodman/dive"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: false
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Parser generator
brew "bison@2.7"
# Statistics utility to count lines of code
brew "cloc"
# Reimplementation of ctags(1)
brew "ctags"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl-openssl"
# Converts boring normal dates to fun Discordian Date
brew "ddate"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Database of common MIME types
brew "shared-mime-info"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Swiss Army Knife for macOS
brew "m-cli"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# TCP port scanner, scans entire Internet in under 5 minutes
brew "masscan"
# Run a Kubernetes cluster locally
brew "minikube"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# DNS benchmark utility
brew "namebench"
# Port scanning utility for large networks
brew "nmap"
# Kubernetes introspection tool for developers
brew "octant"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# OpenBSD and Darwin versions of pgrep, pkill, and pfind
brew "proctools"
# Parse HTML at the command-line
brew "pup"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# SOcket CAT: netcat on steroids
brew "socat"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Linter for Terraform files
brew "tflint"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# In-depth Attack Surface Mapping and Asset Discovery
brew "caffix/amass/amass"
# The fastest shell plugin manager
brew "antibody"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Krypton command-line client, daemon, and SSH integration
brew "kryptco/tap/kr"
# Tool for managing login items
brew "ojford/formulae/loginitems"
# Compares plist files line by line
brew "scottrigby/macos-configurator/pldiff"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
brew "tomanthony/brews/itermocil"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
# A tool for exploring each layer in a docker image
brew "wagoodman/dive/dive"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "amethyst"
cask "aware"
cask "aws-vault"
cask "battle-net"
cask "brave-browser"
cask "cakebrew"
cask "chromedriver"
cask "controlplane"
cask "daisydisk"
cask "dash"
cask "datagrip"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "flash-ppapi"
cask "font-meslo-lg-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "fsmonitor"
cask "google-chrome"
cask "google-cloud-sdk"
cask "insomnia"
cask "istat-menus5"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keybase"
cask "kindle"
cask "launchrocket"
cask "licecap"
cask "mactex"
cask "ngrok"
cask "notion"
cask "opera"
cask "osxfuse"
cask "prey"
cask "qbittorrent"
cask "signal"
cask "silicon-labs-vcp-driver"
cask "skitch"
cask "skype"
cask "slack"
cask "spotify"
cask "steam"
cask "suspicious-package"
cask "switchhosts"
cask "telegram"
cask "tower"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoomus"
mas "Amphetamine", id: 937984704
mas "Cyph", id: 1480070821
mas "GarageBand", id: 682658836
mas "Gemini", id: 463541543
mas "iMovie", id: 408981434
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 715768417
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
